skyblueairlines/app/controllers/application_controller.rb

  def current_user
    puts("into current user")
    if session[:user_id]
      puts("into session")
      @current_user ||= User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]