skyblueairlines/app/controllers/flights_controller.rb

 def index
    if @current_user.email == 'admin@skyblue.com' #to see if the current user is the admin
      @flights = Flight.all
---
SELECT "flights".* FROM "flights"

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("name", "flight_id", "manufacturer", "originCity", "destinationCity", "status", "flight_class", "created_at", "updated_at", "capacity", "flight_cost") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE "flights" SET "flight_class" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["flight_class", "Private"], ["updated_at", "2022-09-29 23:34:16.336885"], ["id", 1]]

  def destroy
    @reservations = Reservation.all
    @reservations.each do |res|
    	if res.flight_id == @flight.id
    		res.destroy
---
SELECT "reservations".* FROM "reservations"
DELETE FROM "flights" WHERE "flights"."id" = ?  [["id", 5]]