skyblueairlines/app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def index
    if(current_user.email == "admin@skyblue.com")
      @reservations = Reservation.all

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @reservation = Reservation.new


    if @flight.nil?
      @flight = Flight.find(params[:flight_id])

SELECT "flights".* FROM "flights"
INSERT INTO "reservations" ("no_of_passengers", "confirmation_number", "amenities", "cost", "created_at", "updated_at", "flight_id", "user_id", "ticket_class") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "flights" SET "capacity" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["capacity", 3], ["updated_at", "2022-10-01 01:07:30.804418"], ["id", 2]]
UPDATE "reservations" SET "amenities" = ?, "cost" = ?, "ticket_class" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["amenities", "None"], ["cost", 349.0], ["ticket_class", "First"], ["updated_at", "2022-09-30 04:04:13.338081"], ["id", 3]]
UPDATE "flights" SET "status" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["status", "Complete"], ["updated_at", "2022-10-01 17:17:38.928784"], ["id", 6]]
---
  def create
    @reservation = Reservation.new(reservation_params)
    @flights = Flight.all

    respond_to do |format|
      if @reservation.save
        format.html { redirect_to reservation_url(@reservation), notice: "Reservation was successfully created." }
        format.json { render :show, status: :created, location: @reservation }
        @flights.each do |flight|
          if @reservation.flight_id == flight.id
            newCapacity = flight.capacity - @reservation.no_of_passengers
            flight.update_attributes(:capacity => newCapacity)
            if(newCapacity == 0)
              flight.update_attributes(:status => "Complete")

UPDATE "reservations" SET "amenities" = ?, "ticket_class" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["amenities", "Extra Legroom"], ["ticket_class", "Economy"], ["updated_at", "2022-10-01 17:16:12.228243"], ["id", 16]]
---
  def update
    respond_to do |format|
      if @reservation.update(reservation_params)

DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 2]]
---
  def destroy
    @reservation.destroy

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_reservation
      @reservation = Reservation.find(params[:id])