skyblueairlines/app/controllers/users_controller.rb

  def index
    if(current_user.email == 'admin@skyblue.com')
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "credit_card_number", "address", "mobile", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

 def update_filter
    respond_to do |format|
      if @user.update_attributes(user_params)
---
UPDATE "users" SET "orig" = ?, "dest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["orig", "Austin"], ["dest", "Boston"], ["updated_at", "2022-09-30 19:04:00.062309"], ["id", 6]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "orig" = ?, "dest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["orig", "new jersey"], ["dest", "raleigh"], ["updated_at", "2022-10-01 18:08:00.419643"], ["id", 11]]

  def destroy
    if(current_user.email == 'admin@skyblue.com')
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 9]]